""" KEK """
import math as m

#На вход вашей программе подается 3 числа (целых).
#A,B,C. Гарантируется, что хотя бы одно из них не нулевое.

#Необходимо найти все решения квадратного уравнения вида:
#A*X^2 +B*X + C =0
#1) Если корня 2: ---> x1 , x2
#2) Если корень 1 : ---> x
#3) Если корней нет : ---> Нет корней!
#4) Если решений нет :---> Нет решений!

#input:        #output:
#1 2 1              -1
#2 1 2         Нет корней!
#0 0 3         Нет решений!

#e-mail: evgeny_vlasov@yahoo.com 
#phone: +7916-646-3387
#t.me: Evgeny_Vlasov



TEMPORARY_NUMBER = m.sqrt(43)
