#Два слова называются синонимами друг друга, если они 
# имеют похожие значения. 
# Реализуйте следующие операции над словарём синонимов:

#ADD word1 word2 — добавить в словарь пару синонимов 
# (word1, word2).
#COUNT word — узнать количество синонимов слова word.
#CHECK word1 word2 — проверить, являются ли слова word1 и word2 синонимами. 
#Слова word1 и word2 считаются синонимами, если среди запросов ADD был хотя бы один запрос ADD word1 word2 или ADD word2 word1.



#Ввод:
#Сначала вводится количество запросов Q, затем Q строк с описаниями запросов. 
# Гарантируется, что в каждом запросе CHECK и ADD слова word1 и word2 различны. 
# Гарантируется, что вводимые строки не пустые

#Вывод:
#Для каждого запроса в соответствующей строке выведите ответ на него:

#В ответ на запрос COUNT word выведите единственное целое число — количество синонимов слова word.
#В ответ на запрос CHECK word1 word2 выведите строку YES, если word1 и word2 являются синонимами, и NO в противном случае.

#Обратите внимание на то, что после операций вида :
#ADD Alexa Amazon
#ADD alexa amaZON
#Количество синонимов не увеличивается, т.к. это одни и те же слова, только в разных регистрах (слово, СлОвО и СЛОВО - эквивалентны)

#Тесты:
#Input:
#8
#ADD program code
#COUNT cipher
#ADD code cipher
#COUNT code
#COUNT program
#CHECK code program
#CHECK program cipher
#CHECK cpp java



#Output:
#0
#2
#1
#YES
#NO
#NO